{
  "places": [
    {
      "name": "Taj Mahal",
      "shortDescription": "Iconic ivory-white mausoleum, symbol of love",
      "longDescription": "Taj Mahal is an ivory-white marble mausoleum located in Agra, India. It was built by Mughal Emperor Shah Jahan in memory of his beloved wife Mumtaz Mahal. The monument is widely recognized as the finest example of Mughal architecture and is considered one of the most beautiful buildings in the world",
      "imageLink": "https://cdn.britannica.com/86/170586-050-AB7FEFAE/Taj-Mahal-Agra-India.jpg",
      "location": "Agra, Uttar Pradesh",
      "activities": "Architecture, Photography, Picnic",
      "sentiment": "Positive",
      "positiveReviews": [
        "Must see I suggest the best timid group to visit this place is Sunrise one must hire a Guide and photographer they will explain and give you best shots of this wonder of the world.",
        "Everything you hope it will be .\nHeavy and segregated (male/female) security to get in but once inside ok. Don't take any food though.\nVery well organised. Spend as long as you can to really soak it all up",
        "An absolute must if you are travelling in Northern India. Purely breathtaking 😊 we had a great guide accompany us which is a must to gain a full appreciation of the history that surrounds this great wonder of the world!",
        "How can it not be a 5 star!  Truly amazing to see/experience in person!  \n\nWe went very early and beat the crowds.\n\nImportant reminder: Do not bring a selfie stick or a tripod, neither are allowed.",
        "Such a romantic story and romantic place to be, the building is massive and the inlay of semi precious gems must have taken years to complete, be aware that you are restricted in what you can take in, no water, small bag, cameras, mobile allowed..."
      ],
      "negativeReviews": [
        "We were so excited about our early morning visit and we weren't disappointed.   Our Agra guide Azar took us and our driver to the drop off point, to walk through the parkland as cars are not allowed due to pollution damaging the Taj.\n\nIt didn't...",
        "Seen the Taj Mahal so many times on the TV and it more than lived up to expectations. We were given a bottle of water and socks (to wear at the mausoleum itself) at the ticket booth. A short electric buggy to main entrance, (avoid...",
        "It's so iconic that it's almost in danger of losing its wow factor. We were there around 5.30am; there was a queue to enter although it didn't feel busy once inside. The ticket includes a \"complimentary\" plastic bottle of water and shoe covers, which sadly...",
        "When visiting TajMahal, be aware that literally every Indian person on the street will offer you a \"guided tour\", and every Indian person with rickshaw will offer you a ride. And by \"offer\" I mean - annoy you to death In other states locals...",
        "A lifeless celebration of death. The  experience is exacerbated by the hagglers who will haunt you like hyenas every step of the way including when you take your  \"memorable\" selfie. A girl was taking  a picture of herself jumping in the air with Tajmahal as..."
      ]
    },
    {
      "name": "Agonda Beach",
      "shortDescription": "Serene and clean beach with clear water and stunning sunset",
      "longDescription": "Agonda Beach is a secluded and peaceful beach in South Goa known for its pristine white sand and crystal clear water. It is a perfect spot for a relaxing vacation, away from the hustle and bustle of city life. The beach is surrounded by hills and coconut groves which adds to its beauty. The calm and quiet atmosphere of the beach attracts tourists who are looking for some peaceful time with nature.",
      "imageLink": "https://www.seawatersports.com/img/newimage/places/agonda-beach.jpg",
      "location": "Agonda, Goa",
      "activities": "Kayaking, Surfing, Swimming, Dolphin watching",
      "sentiment": "Positive",
      "positiveReviews": [
        "a dream palm beach, with nice bars and restaurans. and on both sides of the bay its more exclusive and you find serenity.",
        "We prolonged our stay here, since the little huts are quite relaxed, the beach is nice, water is calm. Only the cows might go a bit nuts from time to time :)",
        "South go is serene and beautiful. Agonda beach is one of the best beaches of south goa and one of the limited beaches where you can get to stay right at the beach. Its beautiful, full of beautiful resorts and shacks most of which are...",
        "Agonda beach is a really beautiful and has an awesome restraunt. Water is water in the sea really clean. The curve line of the beach is really nice. The hut style restraunt is really superb. The beach very tempting you will definitely feel like taking...",
        "Tucked away in South Goa, Agonda beach is a must visit destination. Calm & relaxed and so unspoilt, its an ideal place to spend an afternoon. We visited this beach in monsoons and that too during high tide. And for sure it was fun. Surrounded..."
      ],
      "negativeReviews": [
        "A gem of white sands, Agonda is a long scenic drive to the south of Goa. It is well worth the long drive because unlike the raucous noise and commercial mess that has sadly been made of parts of North Goa, this is the Goa...",
        "The cows infested beach with stench of cow urine and dung. Even the water stinks the same. The wave is very good but destroyed by this unwanted set up.",
        "This was our first visit to Agonda and it won't be our last. Our hotel was at the very north end of the beach and that is where we spent our days. So pea evil and quiet. Further along is still nice and not too...",
        "Agonda beach is one of the few Goa beaches, where though its touristy , its not polluted - by too many people, cars or commercial centres.\nstill quiet , lazy and yet mystical - the Goa charm hangs heavy. almost most huts are on the...",
        "Ive been going agonda for some years now. Not been since 2014 so 4 yr gap. I was shocked at how beach hut prices have risen. We used to get a beach front hut for 1500 rs but now they cost at least 5000 rs...."
      ]
    },
    {
      "name": "Amber Fort",
      "shortDescription": "Majestic fort with intricate architecture and breathtaking views of Jaipur city",
      "longDescription": "Amber Fort, also known as Amer Fort, is a stunning 16th-century hilltop fortress located in Jaipur, Rajasthan. The fort is a masterpiece of Rajput architecture, featuring intricate carvings, mirror work, and stunning mosaics. It offers breathtaking views of Jaipur city and the surrounding Aravalli Hills. Visitors can explore the fort's sprawling palace complex, including the Sheesh Mahal (Hall of Mirrors), Diwan-e-Khas (Private Audience Hall), and Sukh Niwas (Hall of Pleasure).",
      "imageLink": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/17/d3/a8/57/images-30-largejpg.jpg?w=1200&h=1200&s=1",
      "location": "Amer, Rajasthan",
      "activities": "Sightseeing, Photography, Elephant ride, Light and Sound Show",
      "sentiment": "Positive",
      "positiveReviews": [
        "A word if caution - it's a long walk uphill to the fort, and when we visited in April, temperature was 39c. If you're okay with that, prepare for a wonderful experience.\nYou can spend an hour or two wandering around, looking at the amazing...",
        "The big daddy of Forts - in terms of architecture, size and grandeur. Its also superbly maintained which makes it a must visit.",
        "This Palace is a stunning construction, the primary tourist attraction in Jaipur.  The combination of red sandstone and marble makes this structure memorable and significant.  As a World Heritage Site, it attracts approximately two million visitors a year.  Highly suggest that you hire a guide...",
        "Wonderful both in details e.g. the exquisite inlaid stone mosaics, and harmoniously designed  large pavilions and courtyards.",
        "We arrived early before the crowds and had a good walk up the hill to this UNESCO site.  Unfortunately the jeep drivers were on strike, but the elephants were not if you like that sort of thing. We had our own guide who explained what..."
      ],
      "negativeReviews": [
        "Visited this by jeep. Approaches are very steep. Wouldn't want to do the walk, and feel so sorry for the poor elephants who labour up the hill day after day. \nThis was our first foray to an Indian fort. Plenty of interest, lots to see.A...",
        "Our final day of a 9 day tour. This place was by far the worst for hawkers! They stood annoying us whilst we waiting for our Elephant ride (you have to pay for it AND tip the driver heavily or he gets cranky) and then...",
        "This Heritage site was included in our itinerary with our private tour package. When you lined up for the entrance of the site, do not take interest on what the vendors are selling you otherwise they won't leave you alone and you will be harassed...",
        "Amazing place \nHated seeing elephants being used to transport people -this should be stopped\nAlso hawkers harass you",
        "What a shame to see all those horrible tourists waiting to go on those poor elephants to visit the Fort. \nEspecially when you see how they are being treated on the way back down. Their owners hit them so badly with huge sticks to make..."
      ]
    },
    {
      "name": "19 Degree North",
      "shortDescription": "19 Degree North is a mountain resort in the Himalayas with scenic views and adventure sports",
      "longDescription": "19 Degree North is a serene resort located in Lonavala, Maharashtra. It offers luxurious accommodation, spa facilities, and a range of activities including trekking, horse riding, and cycling. The resort is surrounded by lush greenery and provides a perfect getaway from the city's hustle and bustle. Its scenic location and comfortable amenities make it a popular destination for both families and couples seeking a peaceful and relaxing vacation",
      "imageLink": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/3e/14/d6/no-comment.jpg?w=600&h=600&s=1",
      "location": "Lonavala, Maharashtra",
      "activities": "Swimming, Spa, Restaurant",
      "sentiment": "Positive",
      "positiveReviews": [
        "Aamby valley is a beautiful place with its clear blue skies and fresh green grass. My family and I visited aamby valley to celebrate my mother's birthday. My mom had the most splendid time. Thanks to Pinky Bharadwaj for handling our booking from Bombay. Together...",
        "Awesome experience at the ATV\nTracts and obstacles well maintained,\nVery safe yet challenging\n\nHad a blast\n\nGood experience\n\nHelpful instructors :)",
        "Not far from Mumbai, this place is one of the finest adventure places I have visited in recent times. Worth going there and has all safety standards also well maintained and so go and enjoy!!",
        "if you yearn for the adrenaline rush then this place is a must try. The Atv forester for 30 mins was that rush for me.loads more stuff to do there including a kiddie zip line.\nWhat I liked:- the beautiful mountain backdrop while you whizz...",
        "A great adventure place .I recommend  there 4x4 jungle safari a very special  thanks to Mr Rajesh.It offers zorbing, rappelling, wall climbing and paintball all following international safety standards . Equipments are very well maintained."
      ],
      "negativeReviews": [
        "Adjacent to Chand Baori- the old statue was stolen and it has new statue.Plenty of carved stone pieces lying there which have been removed from temple site.",
        "Of all of the temples I visited in northern India, this was very unique from any of the others. The unfortunate distinction was that this 8th century temple appeared (and I learned actually was) severely damaged and then rebuilt.  Still, much of the temple has...",
        "It is close to Abhaneri step well. The temple is in very bad state of ruin thanks to the Muslim invaders who broke many of the sculptures in the temple. It is a 8th century temple as per the inscriptions near the temple. Quality of...",
        "This is my humble requests for all tourist people don’t go to the kuntala waterfall. It is very dangerous evil place and its kill one person on every Saturday. All local village people known about the evilness and they don’t disclose for tourist. No help...",
        "We utterly regret visiting this fools paradise called the \"Indian Spice & Herbal Garden - Idukki\".  M/s Tamarind Tours must take note of the negative reviews illustrated of this place and avoid recommending & publicizing their clients/travellers from visitng this FLEE MARKET.  Gives Kerala Spice..."
      ]
    },
    {
      "name": "Agra Fort",
      "shortDescription": "Agra Fort is a UNESCO World Heritage site, a red sandstone fortress of Mughal era",
      "longDescription": "Agra Fort, located in Agra, India, is a UNESCO World Heritage Site and one of the most popular tourist destinations in India. It is a red sandstone fort that served as the main residence of the Mughal emperors until 1638. The fort features several beautiful palaces, including the Jahangiri Mahal and the Khas Mahal, and the Diwan-i-Am and Diwan-i-Khas, which were used for public and private audiences. The fort also provides stunning views of the Taj Mahal, making it a must-visit destination for those touring Agra",
      "imageLink": "https://cdn.britannica.com/37/178637-050-22E50FA5/Jahangirs-Palace-Agra-Fort-India-Uttar-Pradesh.jpg",
      "location": "Agra, Uttar Pradesh",
      "activities": "Photography, Architecture, Sound and light show",
      "sentiment": "Negative",
      "positiveReviews": [
        "Absolut impressive! You can imagine the history of the powerful family and how they lived and found their decisions. Seeing this creates ideas of the old stories.",
        "Must see place in Agra.A historical place with some of common ruler having there contribution. Shahajahan who built Taj was house arrested in this fort .It is wonderful to see this which has wonderful carvings. View from here of Taj is amazing. Hire a guide...",
        "Agra Fort well preserves and still well maintained. You can see Taj Mahal from some of the windows and that's the best part of Agra Fort. Full of hidden history and lots of spots for pictures. Agra Fort have a lovely garden but please avoid...",
        "Pretty good fort that cost 600Rs to enter. Really nice if you haven't visited any other forts in India. Otherwise nothing special.",
        "Spend at least a couple of hours and take plenty of water, e ticket in advance really helps. The view across to Taj Mahal is fantastic. Be prepared read up on what to can and cannot take in, anything from food, sweets, cigarettes, or anything..."
      ],
      "negativeReviews": [
        "As I watched these poor beasts being forced to carry hoards of tourists back and forth up the hill and into the fort and back again, painted like circus clowns, I felt such sadness for them. I don't understand how people can be so ignorant...",
        "The history of the Taj can only be grasped totally after a visit to this fort. The panoramic view of the Yamuna offers a travel in Time. The vast river has shrunk alarmingly but the view of Taj from place Shahjahan was imprisoned , is...",
        "If you want to know about life of Mughals, how they lived, you can visit this place.\nAvoid Sound and Light show here. Its pathetic, run by ASI. Waste of time and money.",
        "We went to see the wonderful Taj Mahal. As beautiful as it is, it almost isn't worth the vile and disgusting surroundings, beggars, extremely annoying and chaotic rickshaw drivers and locals hounding you at every moment, poor restaurants and heavy air and pollution. Extremely depressing...",
        "Nothing to see here.\n\nRip off from money entrance and nothing to see.\n\nAll dirty and smells bad.\n\nAll facilities inside are closed, so nothing to see."
      ]
    },
    {
      "name": "Jagannath Temple",
      "shortDescription": "Jagannath Temple is a historic Hindu temple in Puri, dedicated to Lord Jagannath",
      "longDescription": "Jagannath Temple is a famous Hindu temple located in Puri, Odisha, India. It is dedicated to Lord Jagannath, an incarnation of Lord Vishnu. The temple is known for its intricate architecture and sculptures. The annual Rath Yatra festival attracts millions of pilgrims from all over India. The temple has a unique kitchen called \"Ananda Bazaar\" that feeds thousands of devotees every day. The temple is considered as one of the Char Dhams, the four sacred abodes of Hinduism.",
      "imageLink": "https://upload.wikimedia.org/wikipedia/commons/8/82/%E0%AC%9C%E0%AC%97%E0%AC%A8%E0%AD%8D%E0%AC%A8%E0%AC%BE%E0%AC%A5_%E0%AC%AE%E0%AC%A8%E0%AD%8D%E0%AC%A6%E0%AC%BF%E0%AC%B0%2C_%E0%AC%B9%E0%AC%BE%E0%AC%87%E0%AC%A6%E0%AD%8D%E0%AC%B0%E0%AC%BE%E0%AC%AC%E0%AC%BE%E0%AC%A6.jpg",
      "location": "Puri, Odisha",
      "activities": "Prayer, traditional music and dance",
      "sentiment": "Positive",
      "positiveReviews": [
        "Big compound with a number of temples. Peaceful place to be if you happen to be a Hindu. The complex houses various gods with Lord Jagannath in centrepiece.",
        "Nice temple with a quiet environment. If you are looking for something spiritual in Agartala, I specially recommend this place.You can have a meal there by buying coupons for lunch. Entry is free.",
        "this place is really bring the old memories of Puri Jagannath temple & the idols are excellent , just as good as Puri Temple",
        "If you are in the vicinity vising the Government Museum do visit the temple as well. One of the better kept of the many temples in the city",
        "Small but beautiful temple at the heart of city. Neat and clean, well maintained. Popular within local people."
      ],
      "negativeReviews": [
        "Nothing much to see that is ancient and on top of that a rude priest obscenely hand gestured my husband and asked him to get out. There was no sign that foreigners are not allowed. Yes, Hinduism has been brought to this nasty, low lever...",
        "The name of city of ‘Bangalore or Bengaluru’ is made up of combination of Kannada words ‘benda+ kalu+ ooru’,  meaning thereby boiled+ grains+ village or place to mean  the village of boiled beans. According to legend, Hoysala king Veeraballala lost his way during his hunting..."
      ]
    },
    {
      "name": "Swaminarayan Akshardham",
      "shortDescription": "Hindu temple showcasing Indian culture, architecture and spirituality",
      "longDescription": "Swaminarayan Akshardham is a Hindu temple complex in Gandhinagar, Gujarat, India. It showcases the essence of Hindu culture, art, and architecture. The temple is a blend of ancient Indian wisdom and modern technology. Visitors can admire the intricate carvings, beautiful sculptures, and stunning gardens.",
      "imageLink": "https://upload.wikimedia.org/wikipedia/commons/7/77/Akshardham_Gandhinagar_Gujarat.jpg",
      "location": "Gandhinagar, Gujarat",
      "activities": "Worship, Musical Fountain Show, Light and Sound Show",
      "sentiment": "Positive",
      "positiveReviews": [
        "A great place to visit ocean view just infront of hotel Taj in night lighting is very beautiful must visit place in whole Mumbai . Lot of crowd . A cool place to hangout .",
        "It it a stunning piece of architecture but it's closed off to go underneath which is a shame. Worth a visit though with excellent views of the Taj Mahal hotel and a cute port, it's the perfect place to snap a few photos. Although be...",
        "very nice place for morning and evening walk. enjoy the breeze and street food.\nboating facility is also available. what else ur want, just enjoy on weekends. always crowded.",
        "A monument build to welcome new UK prince to Mumbai, India in 19th century. \n\nWell maintained, bit crowdy. Cozy place to be at, with friends, family. You can get a glimpse of Arabian sea on one side and world famous Taj hotel on the other...",
        "It is a nice place to roam arround Tajmahal palace and enjoy your evening with nice food in near streets."
      ],
      "negativeReviews": [
        "Without a doubt the most iconic monument/place in Mumbai. If you come to Mumbai this has to be on your list, cliched as it may be. I meant think about it, if you go to Paris you WILL go to the Eiffel Tower right? Well...this...",
        "The gate is overrun by tour guides and those selling junk who are extremely aggressive.  I literally had to push aggressive sales people off of me.  I had a guy trying to sell me a suit for two blocks until I went into the Taj...",
        "This magnanimous monument erected in the British Era adjacent to Taj stands tall in the heart of Mumbai. It has got some invisible power which takes away all your stress. I have visited this place uncountable number of times and the experience has been similar...",
        "Re-visiting this place now after my childhood brought back a lot of memories. But sadly the cleanliness is very poor. There is so much to see around. Architecture is amazing along with the view of the sea and The Taj Mahal Hotel.",
        "We actually landed here by accident. Our tour for mixed up and we decided to walk down to the water and boom here it was. \n\nThere is really nothing to do here but it is packed!!\n\nThe Taj Palace is across the street and this..."
      ]
    },
    {
      "name": "Golden Temple",
      "shortDescription": "Sikhism's holiest shrine, golden-domed temple surrounded by a sacred pool",
      "longDescription": "The Golden Temple, also known as Sri Harmandir Sahib or Darbar Sahib, is the most revered pilgrimage site of the Sikh faith. The gilded structure is surrounded by the sacred Amrit Sarovar pool, which is said to have healing properties. The complex also houses the Akal Takht, the highest seat of Sikh authority. The daily langar (free meal) served to visitors is one of the largest community kitchens in the world.",
      "imageLink": "https://upload.wikimedia.org/wikipedia/commons/9/94/The_Golden_Temple_of_Amrithsar_7.jpg",
      "location": "Gandhinagar, Gujarat",
      "activities": "Religious, Spiritual, Sightseeing",
      "sentiment": "Positive",
      "positiveReviews": [
        "So wonderful, so powerful and so beautiful.\nIf you’re attending to go, make sure you’re visiting both day and night. The sight is completely different and special.\nAlso I’ll recommend to spend the night in a good hotel - close to the temple.\nYou don’t...",
        "The Harmandir Sahib, also known as Darbar Sahib (Punjabi pronunciation:  \"Abode of God\", \"Exalted Holy Court\", is a Gurdwara located in the city of Amritsar, Punjab, India.\nThe Gurdwara is spiritually the most significant shrine in the Sikh Religion.",
        "This place is so beautiful. I went there last week . People across the globe use to come and visit Golden Temple.",
        "The golden temple was absolutely beautiful. \nDefinitely go early in the morning (we arrived around 5am, the temple opens at like 3:30am or something) because as the day goes on it gets more and more crowded and also a lot hotter. It was also really...",
        "What a wonderfully managed place. It turns your heart to Gold! Makes you feel so emotional and full of devotion. You develop a sense of pride for the entire Sikh community and also for the country. A must see by everyone."
      ],
      "negativeReviews": [
        "There is now doubt that this is a must see. The historic value and religious significance is beyond doubt. Be prepared to stand in a chaotic line with lots of pushing and shoving for about two hours before you enter. In the past this was...",
        "Its a holy place, so do be aware of that. Follow all the rules.\nThe temple has place to store your luggage also, which means you do not have to be worried about your bags.\n\nPlan your visit, as somedays there are too many people....",
        "We decided to visit at dark as people had said that seeing it all illuminated was something else. They were not wrong. Hundreds of people being reverential was quite humbling.",
        "The only place in this world where i cant say No to whenever i visit India...once step in you will feel all the negativity in you clears and you are totally a different person altogether...if give the option i wana stay there forever and listen...",
        "it can take upto 3-4 hours or more to enter the temple as it is very crowded there. also people were rude to us as they did not allow us to click photographs. i donot know about others, but for me this was not very..."
      ]
    }
  ]
}