[
  {
    "name": "Aamby valley",
    "shortDescription": "Aamby Valley is a luxury resort town located in the Western Ghats of Maharashtra, India. It covers an area of over 10,000 acres and offers a wide range of leisure and adventure",
    "imageLink": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/07/3e/14/d6/no-comment.jpg?w=600&h=600&s=1",
    "positiveReviews": [
      "Aamby valley is a beautiful place with its clear blue skies and fresh green grass. My family and I visited aamby valley to celebrate my mother's birthday. My mom had the most splendid time. Thanks to Pinky Bharadwaj for handling our booking from Bombay. Together...",
      "Awesome experience at the ATV\nTracts and obstacles well maintained,\nVery safe yet challenging\n\nHad a blast\n\nGood experience\n\nHelpful instructors :)",
      "Not far from Mumbai, this place is one of the finest adventure places I have visited in recent times. Worth going there and has all safety standards also well maintained and so go and enjoy!!",
      "if you yearn for the adrenaline rush then this place is a must try. The Atv forester for 30 mins was that rush for me.loads more stuff to do there including a kiddie zip line.\nWhat I liked:- the beautiful mountain backdrop while you whizz...",
      "A great adventure place .I recommend  there 4x4 jungle safari a very special  thanks to Mr Rajesh.It offers zorbing, rappelling, wall climbing and paintball all following international safety standards . Equipments are very well maintained."
    ],
    "negativeReviews": [
      "Adjacent to Chand Baori- the old statue was stolen and it has new statue.Plenty of carved stone pieces lying there which have been removed from temple site.",
      "Of all of the temples I visited in northern India, this was very unique from any of the others. The unfortunate distinction was that this 8th century temple appeared (and I learned actually was) severely damaged and then rebuilt.  Still, much of the temple has...",
      "It is close to Abhaneri step well. The temple is in very bad state of ruin thanks to the Muslim invaders who broke many of the sculptures in the temple. It is a 8th century temple as per the inscriptions near the temple. Quality of...",
      "This is my humble requests for all tourist people don’t go to the kuntala waterfall. It is very dangerous evil place and its kill one person on every Saturday. All local village people known about the evilness and they don’t disclose for tourist. No help...",
      "We utterly regret visiting this fools paradise called the \"Indian Spice & Herbal Garden - Idukki\".  M/s Tamarind Tours must take note of the negative reviews illustrated of this place and avoid recommending & publicizing their clients/travellers from visitng this FLEE MARKET.  Gives Kerala Spice..."
    ]
  }

]